# IsValidCategoryForEmbeddedSchedule Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..IsValidCategoryForEmbeddedSchedule Method
ScheduleDefinition Class See Also
---
Indicates if a category can be used for an embedded ScheduleDefinition in this ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsValidCategoryForEmbeddedSchedule(
	ElementId categoryId
)
```

Visual Basic
---
```text
Public Function IsValidCategoryForEmbeddedSchedule ( _
	categoryId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidCategoryForEmbeddedSchedule(
	ElementId^ categoryId
)
```

# ### Parameters
categoryId
    Type: Autodesk.Revit.DB..::..ElementId The category ID to check.
# ### Return Value
True if the category can be used for an embedded ScheduleDefinition, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace